Revit 2027 API
PipeFittingAndAccessoryData.PartType Property
 The part type of the pipe fitting or pipe accessory.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PartType PartType { get; }
Public ReadOnly Property PartType As PartType
	Get
public:
property PartType PartType {
	PartType get ();
}
member PartType : PartType with get
Property Value
PartType
See Also
Reference
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace